app/controllers/likes_controller.rb

SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 129], ["LIMIT", 1]]
INSERT INTO "likes" ("author_id", "post_id", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["author_id", nil], ["post_id", 130], ["created_at", "2023-06-30 20:31:58.406014"], ["updated_at", "2023-06-30 20:31:58.406014"], ["user_id", 4]]
---
  def create
    @post = Post.find(params[:post_id])
    @like = Like.create(author: current_user, post: @post)