app/controllers/users_controller.rb

SELECT "users".* FROM "users"
---
  def index;
    @users = User.all

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
  def show;
    @user = User.find(params[:id])