app/models/comment.rb

    def update_post_comments_counter
      post.update(comments_counter: post.comments.count)
---
SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 129]]
UPDATE "posts" SET "comments_counter" = $1, "updated_at" = $2 WHERE "posts"."id" = $3  [["comments_counter", 1], ["updated_at", "2023-06-30 20:05:05.456641"], ["id", 129]]