app/models/like.rb

  def increase_like_counter
    post.increment!(:likes_counter)
---
UPDATE "posts" SET "likes_counter" = $1, "updated_at" = $2 WHERE "posts"."id" = $3  [["likes_counter", 1], ["updated_at", "2023-06-30 20:31:58.447971"], ["id", 130]]

  def update_post_likes_counter
    post.update(likes_counter: post.likes.count)
---
SELECT COUNT(*) FROM "likes" WHERE "likes"."post_id" = $1  [["post_id", 130]]